0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x7.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>AES_0</name>
			<version>B</version>
			<description>None</description>
			<groupName>AES_0</groupName>
			<baseAddress>0x40027000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>AES0_IRQn</name>
				<value>35</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XFRSTA</name>
							<description>AES Transfer Start. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>START</name>
									<description>Start the AES operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>KEYCPEN</name>
							<description>Key Capture Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable key capture.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable key capture.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDMD</name>
							<description>Encryption/Decryption Mode. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DECRYPT</name>
									<description>AES module performs a decryption operation</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENCRYPT</name>
									<description>AES module performs an encryption operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SWMDEN</name>
							<description>Software Mode Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable software mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable software mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BEN</name>
							<description>Bypass AES Operation Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not bypass AES operations.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Bypass AES operations.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XOREN</name>
							<description>XOR Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>XOR_DISABLED</name>
									<description>Disable the XOR paths.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XOR_INPUT</name>
									<description>Enable the XOR input path, disable the XOR output path.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XOR_OUTPUT</name>
									<description>Disable the XOR input path, enable the XOR output path.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCTREN</name>
							<description>Hardware Counter Mode Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable hardware counter mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable hardware counter mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCBCEN</name>
							<description>Hardware Cipher-Block Chaining Mode Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable hardware cipher-block chaining (CBC) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable hardware cipher-block chaining (CBC) mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>KEYSIZE</name>
							<description>Keystore Size Select. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>KEY128</name>
									<description>Key is composed of 128 bits.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEY192</name>
									<description>Key is composed of 192 bits.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEY256</name>
									<description>Key is composed of 256 bits.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERRIEN</name>
							<description>Error Interrupt Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the error interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the error interrupt. An interrupt is generated when the Input/Output Data FIFO Overun (DORI), Input/Output Data FIFO Underun (DURI), or XOR Data FIFO Overrun (XORI) flags are set.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCIEN</name>
							<description>Operation Complete Interrupt Enable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the operation complete interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the operation complete interrupt. An interrupt is generated when the Operation Complete Interrupt (OCI) flag is set.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>AES Debug Mode. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the AES module to halt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN</name>
									<description>The AES module will continue to operate while the core is halted in debug mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET</name>
							<description>Module Soft Reset. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>AES module is not in soft reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>AES module is in soft reset and none of the module bits can be accessed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>XFRSIZE</name>
					<description>Number of Blocks</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XFRSIZE</name>
							<description>Transfer Size. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DATAFIFO</name>
					<description>Input/Output Data FIFO Access</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATAFIFO</name>
							<description>Input/Output Data FIFO Access. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>XORFIFO</name>
					<description>XOR Data FIFO Access</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XORFIFO</name>
							<description>XOR Data FIFO Access. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY0</name>
					<description>Hardware Key Word 0</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY0</name>
							<description>Hardware Key Word 0. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY1</name>
					<description>Hardware Key Word 1</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY1</name>
							<description>Hardware Key Word 1. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY2</name>
					<description>Hardware Key Word 2</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY2</name>
							<description>Hardware Key Word 2. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY3</name>
					<description>Hardware Key Word 3</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY3</name>
							<description>Hardware Key Word 3. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY4</name>
					<description>Hardware Key Word 4</description>
					<addressOffset>0x80</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY4</name>
							<description>Hardware Key Word 4. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY5</name>
					<description>Hardware Key Word 5</description>
					<addressOffset>0x90</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY5</name>
							<description>Hardware Key Word 5. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY6</name>
					<description>Hardware Key Word 6</description>
					<addressOffset>0xa0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY6</name>
							<description>Hardware Key Word 6. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY7</name>
					<description>Hardware Key Word 7</description>
					<addressOffset>0xb0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY7</name>
							<description>Hardware Key Word 7. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWCTR0</name>
					<description>Hardware Counter Word 0</description>
					<addressOffset>0xc0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWCTR0</name>
							<description>Hardware Counter Word 0. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWCTR1</name>
					<description>Hardware Counter Word 1</description>
					<addressOffset>0xd0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWCTR1</name>
							<description>Hardware Counter Word 1. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWCTR2</name>
					<description>Hardware Counter Word 2</description>
					<addressOffset>0xe0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWCTR2</name>
							<description>Hardware Counter Word 2. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWCTR3</name>
					<description>Hardware Counter Word 3</description>
					<addressOffset>0xf0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWCTR3</name>
							<description>Hardware Counter Word 3. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
