0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x7.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CLKCTRL_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>CLKCTRL_0</groupName>
			<baseAddress>0x4002d000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x10000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AHBSEL</name>
							<description>AHB Clock Source Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LPOSC0</name>
									<description>AHB clock source is the Low-Power Oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC0</name>
									<description>AHB clock source is the Low-Frequency Oscillator.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC0TCLK</name>
									<description>AHB clock source is the RTC0TCLK signal.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTOSC0</name>
									<description>AHB clock source is the External Oscillator.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VIORFCLK</name>
									<description>AHB clock source is the VIORFCLK input pin.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL0OSC</name>
									<description>AHB clock source is the PLL.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPOSC0_DIV</name>
									<description>AHB clock source is a divided version of the Low-Power Oscillator.</description>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AHBDIV</name>
							<description>AHB Clock Divider. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>AHB clock divided by 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>AHB clock divided by 2.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>AHB clock divided by 4.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>AHB clock divided by 8.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>AHB clock divided by 16.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>AHB clock divided by 32.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>AHB clock divided by 64.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>AHB clock divided by 128.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APBDIV</name>
							<description>APB Clock Divider. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>APB clock is the same as the AHB clock (divided by 1).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>APB clock is the AHB clock divided by 2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTESEL</name>
							<description>External Clock Edge Select. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>BOTH_EDGES</name>
									<description>External clock generated by both rising and falling edges of the external oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_ONLY</name>
									<description>External clock generated by only rising edges of the external oscillator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OBUSYF</name>
							<description>Oscillators Busy Flag. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AHB and APB oscillators are not busy.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AHB and APB oscillators are busy and the AHBSEL, AHBDIV, and APBDIV fields should not be modified.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VIORFCLKEN</name>
							<description>VIORF Clock Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the VIORFCLK input.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the VIORFCLK input.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTOSCEN</name>
							<description>External Clock Input Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EXTOSC input.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the EXTOSC input.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKG</name>
					<description>AHB Clock Gate</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000005</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RAMCEN</name>
							<description>RAM Clock Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AHB clock to the RAM.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AHB clock to the RAM.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMACEN</name>
							<description>DMA Clock Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AHB clock to the DMA Controller.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AHB clock to the DMA Controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FLASHCEN</name>
							<description>Flash Clock Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AHB clock to the Flash.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AHB clock to the Flash.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTM0EN</name>
							<description>DTM0 Clock Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AHB clock to Data Transfer Manager 0 (DTM0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AHB clock to Data Transfer Manager 0 (DTM0).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTM1EN</name>
							<description>DTM1 Clock Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AHB clock to Data Transfer Manager 1 (DTM1).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AHB clock to Data Transfer Manager 1 (DTM1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTM2EN</name>
							<description>DTM2 Clock Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AHB clock to Data Transfer Manager 2 (DTM2).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AHB clock to Data Transfer Manager 2 (DTM2).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
