0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x7.svd
				<register>
					<name>PWPOL</name>
					<description>Pin Wake Pin Polarity Select</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PW0POL</name>
							<description>WAKE.0 Polarity Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.0 causes a Pin Wake event if PW0EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.0 causes a Pin Wake event if PW0EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW1POL</name>
							<description>WAKE.1 Polarity Select. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.1 causes a Pin Wake event if PW1EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.1 causes a Pin Wake event if PW1EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW2POL</name>
							<description>WAKE.2 Polarity Select. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.2 causes a Pin Wake event if PW2EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.2 causes a Pin Wake event if PW2EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW3POL</name>
							<description>WAKE.3 Polarity Select. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.3 causes a Pin Wake event if PW3EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.3 causes a Pin Wake event if PW3EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW4POL</name>
							<description>WAKE.4 Polarity Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.4 causes a Pin Wake event if PW4EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.4 causes a Pin Wake event if PW4EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW5POL</name>
							<description>WAKE.5 Polarity Select. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.5 causes a Pin Wake event if PW5EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.5 causes a Pin Wake event if PW5EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW6POL</name>
							<description>WAKE.6 Polarity Select. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.6 causes a Pin Wake event if PW6EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.6 causes a Pin Wake event if PW6EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW7POL</name>
							<description>WAKE.7 Polarity Select. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.7 causes a Pin Wake event if PW7EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.7 causes a Pin Wake event if PW7EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW8POL</name>
							<description>WAKE.8 Polarity Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.8 causes a Pin Wake event if PW8EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.8 causes a Pin Wake event if PW8EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW9POL</name>
							<description>WAKE.9 Polarity Select. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.9 causes a Pin Wake event if PW9EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.9 causes a Pin Wake event if PW9EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW10POL</name>
							<description>WAKE.10 Polarity Select. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.10 causes a Pin Wake event if PW10EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.10 causes a Pin Wake event if PW10EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW11POL</name>
							<description>WAKE.11 Polarity Select. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.11 causes a Pin Wake event if PW11EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.11 causes a Pin Wake event if PW11EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW12POL</name>
							<description>WAKE.12 Polarity Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.12 causes a Pin Wake event if PW12EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.12 causes a Pin Wake event if PW12EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW13POL</name>
							<description>WAKE.13 Polarity Select. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.13 causes a Pin Wake event if PW13EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.13 causes a Pin Wake event if PW13EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW14POL</name>
							<description>WAKE.14 Polarity Select. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.14 causes a Pin Wake event if PW14EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.14 causes a Pin Wake event if PW14EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW15POL</name>
							<description>WAKE.15 Polarity Select. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A logic low on WAKE.15 causes a Pin Wake event if PW15EN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A logic high on WAKE.15 causes a Pin Wake event if PW15EN is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
