0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x7.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PBCFG_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>PBCFG_0</groupName>
			<baseAddress>0x4002a000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PBEXT0_IRQn</name>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>PBEXT1_IRQn</name>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>PMATCH_IRQn</name>
				<value>41</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL0</name>
					<description>Global Port Control 0</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INT0SEL</name>
							<description>External Interrupt 0 Pin Selection. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INT0_0</name>
									<description>Select INT0.0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_1</name>
									<description>Select INT0.1</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_2</name>
									<description>Select INT0.2</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_3</name>
									<description>Select INT0.3</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_4</name>
									<description>Select INT0.4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_5</name>
									<description>Select INT0.5</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_6</name>
									<description>Select INT0.6</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_7</name>
									<description>Select INT0.7</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_8</name>
									<description>Select INT0.8</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_9</name>
									<description>Select INT0.9</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_10</name>
									<description>Select INT0.10</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_11</name>
									<description>Select INT0.11</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_12</name>
									<description>Select INT0.12</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_13</name>
									<description>Select INT0.13</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_14</name>
									<description>Select INT0.14</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_15</name>
									<description>Select INT0.15</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT0POL</name>
							<description>External Interrupt 0 Polarity. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A low value or falling edge on the selected pin will cause interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A high value or rising edge on the selected pin will cause interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT0MD</name>
							<description>External Interrupt 0 Mode. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LEVEL</name>
									<description>Interrupt on logic level at pin, as selected by the INT0POL field.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE</name>
									<description>Interrupt on either rising or falling edge, as selected by the INT0POL field.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DUAL_EDGE</name>
									<description>Interrupt on both rising and falling edges (ignores INT0POL).</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT0EN</name>
							<description>External Interrupt 0 Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable external interrupt 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable external interrupt 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT1SEL</name>
							<description>External Interrupt 1 Pin Selection. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INT1_0</name>
									<description>Select INT1.0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_1</name>
									<description>Select INT1.1</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_2</name>
									<description>Select INT1.2</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_3</name>
									<description>Select INT1.3</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_4</name>
									<description>Select INT1.4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_5</name>
									<description>Select INT1.5</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_6</name>
									<description>Select INT1.6</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_7</name>
									<description>Select INT1.7</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_8</name>
									<description>Select INT1.8</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_9</name>
									<description>Select INT1.9</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_10</name>
									<description>Select INT1.10</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_11</name>
									<description>Select INT1.11</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_12</name>
									<description>Select INT1.12</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_13</name>
									<description>Select INT1.13</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_14</name>
									<description>Select INT1.14</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT1_15</name>
									<description>Select INT1.15</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT1POL</name>
							<description>External Interrupt 1 Polarity. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>A low value or falling edge on the selected pin will cause interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>A high value or rising edge on the selected pin will cause interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT1MD</name>
							<description>External Interrupt 1 Mode. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LEVEL</name>
									<description>Interrupt on logic level at pin, as selected by the INT1POL field.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE</name>
									<description>Interrupt on either rising or falling edge, as selected by the INT1POL field.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DUAL_EDGE</name>
									<description>Interrupt on both rising and falling edges (ignores INT1POL).</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT1EN</name>
							<description>External Interrupt 1 Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable external interrupt 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable external interrupt 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PGTIMER</name>
							<description>Pulse Generator Timer. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>PGDONEF</name>
							<description>Pulse Generator Timer Done Flag. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Firmware has written to the PBPGPHASE register, but the Pulse Generator timer has not expired.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The Pulse Generator cycle finished since the last time PBPGPHASE was written.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL1</name>
					<description>Global Port Control 1</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>JTAGEN</name>
							<description>JTAG Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>JTAG functionality is not pinned out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>JTAG functionality is pinned out.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ETMEN</name>
							<description>ETM Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>ETM not pinned out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>ETM is enabled and pinned out.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SWVEN</name>
							<description>SWV Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>SWV is not pinned out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>SWV is enabled and pinned out.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1SEL</name>
							<description>SPI1 Fixed Port Selection. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disconnect SPI1 from the dedicated pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Connect SPI1 to the dedicated pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMATCHEN</name>
							<description>Port Match Interrupt Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the port match logic. The PBnMAT registers are not read/write accessible on the APB bus.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the port match logic to generate a port match interrupt. The PBnMAT registers are read/write accessible on the APB bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPTOSEL</name>
							<description>Low Power Timer Output Pin Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LPT0OUT0</name>
									<description>Route the Low Power Timer output to LPT0OUT0. </description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPT0OUT1</name>
									<description>Route the Low Power Timer output to LPT0OUT1. </description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>Port Bank Configuration Lock. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Port Bank Configuration and Control registers are unlocked.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>The following registers are locked from write access: CONTROL1, XBAR0, and all PBSKIP registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
